| -resize | width             |
| -resize | xheight           |
| -resize | widthxheight      |
| -resize | widthxheight^     |
| -resize | widthxheight!     |
| -resize | widthxheight>     |
| -resize | widthxheight<     |
| -resize | area@             |

Fix image aspect ratios for Instagram:

#+BEGIN_SRC sh
  $ mogrify -resize 1080x1350 -gravity center -extent 1080 *.jpg
#+END_SRC

* [2015-07-15 Wed] Settling scores with an org table
:PROPERTIES:
:CUSTOM_ID: settling-scores-with-an-org-table
:END:
Recently kept track of expenses between a group of us. To settle the scores, I emailed an exported HTML table from an org file. This was simple enough and required no external viewer from recepients. The org table, in all its textful glory, looked as follows...

#+BEGIN_EXAMPLE

| Date             | Item           |   Charge |
|------------------+----------------+----------|
| [2015-06-18 Thu] | Cash           |    20.00 |
| [2015-07-11 Sat] | Lucky 7        |    42.97 |
| [2015-07-13 Mon] | Santa Maria    |    32.00 |
| [2015-07-12 Sun] | Tayyabs        |    46.00 |
| [2015-07-13 Mon] | The Brass Rail |    39.00 |
| [2015-07-13 Mon] | Underground    |    10.00 |
| [2015-07-10 Fri] | Cash           |    20.00 |
| [2015-07-13 Mon] | Cash           |    20.00 |
| [2015-07-14 Tue] | Cash           |    20.00 |
|------------------+----------------+----------|
|                  | total          | £ 249.97 |
,#+TBLFM: @11$3=vsum(@2..@10);£ %.2f
#+END_EXAMPLE

...while the exported HTML below could be easily pasted on to an email.

| Date             | Item           |   Charge |
|------------------+----------------+----------|
| [2015-06-18 Thu] | Cash           |    20.00 |
| [2015-07-11 Sat] | Lucky 7        |    42.97 |
| [2015-07-13 Mon] | Santa Maria    |    32.00 |
| [2015-07-12 Sun] | Tayyabs        |    46.00 |
| [2015-07-13 Mon] | The Brass Rail |    39.00 |
| [2015-07-13 Mon] | Underground    |    10.00 |
| [2015-07-10 Fri] | Cash           |    20.00 |
| [2015-07-13 Mon] | Cash           |    20.00 |
| [2015-07-14 Tue] | Cash           |    20.00 |
|------------------+----------------+----------|
|                  | total          | £ 249.97 |
#+TBLFM: @11$3=vsum(@2..@10);£ %.2f

